source/app/controllers/admin/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "is_published", "slug", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @post = Post.new(params[:post])

    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "title" = 'New Stuff', "slug" = 'new-stuff', "updated_at" = '2014-02-20 01:38:14.346053' WHERE "posts"."id" = 1
---
  def update
    @post = Post.find(params[:id])

    if @post.update_attributes(params[:post])