source/app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "is_published", "slug", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "stuff"], ["created_at", Thu, 20 Feb 2014 00:56:25 UTC +00:00], ["is_published", false], ["slug", "stuff"], ["title", "Stuff"], ["updated_at", Thu, 20 Feb 2014 00:56:25 UTC +00:00]]